; domain
; My first fully functioning domain:
; This domain is for transporting cargo from location to location using planes and trucks.
; This domain has a cost for every action
; Keeps track of time using static predicates 

(define(domain expensive-transport)

    (:requirements :action-costs :typing)

    (:predicates

        (in ?object ?location)
        (at ?object ?location)
        (location ?location)
        (cargo ?object)
        (plane ?object)
        (airport ?object)
        (truck ?object)
        (day-to-day ?day1 ?day2) ;day-to-day is a static predicate that keeps track of time for the actions fly and drive 
        (current_time ?day1) ; keeps track of the current time

    )

    (:functions
        ; function to keep track of costs
        (total-cost) - number
    )
    ; loads cargo to the plane.
    ; the action load has a cost of 2 units
    (:action load
        :parameters (?cargo ?plane ?airport)
        :precondition (and (at ?cargo ?airport)
            (at ?plane ?airport)
            (cargo ?cargo)
            (plane ?plane)
            (airport ?airport))
        :effect (and (not (at ?cargo ?airport))
            (in ?cargo ?plane)
            (increase (total-cost) 2))
    )
    ; unloads cargo from the plane to the airport
    ; the action unload has a cost of 2 units
    (:action unload
        :parameters (?cargo ?plane ?airport)
        :precondition (and (in ?cargo ?plane)
            (at ?plane ?airport)
            (cargo ?cargo)
            (plane ?plane)
            (airport ?airport))
        :effect (and (not (in ?cargo ?plane))
            (at ?cargo ?airport)
            (increase (total-cost) 2))
    )
    ; fly from ariport to another airport
    ; this action uses day-to-day predicate and populate it, in other words the action takes on day to complete.
    ; sets the current time has to be specifed in init state and one of the effects of fly action is to set the current time to next day.
    ; the action fly has a cost of 5 units  
    (:action fly
        :parameters (?plane ?from ?to ?day1 ?day2)
        :precondition (and
            (at ?plane ?from)
            (plane ?plane)
            (airport ?from)
            (airport ?to)
            (current_time ?day1)
            (day-to-day ?day1 ?day2)
        )
        :effect (and
            (not (at ?plane ?from))
            (at ?plane ?to)
            (increase (total-cost) 5)
            (not (current_time ?day1))
            (current_time ?day2)
        )
    )
    ; drive from location to location
    ; this action uses day-to-day and current-time just like fly action above
    ; the action drive has a cost of 3 units 
    (:action drive
        :parameters (?truck ?from ?to ?day1 ?day2)
        :precondition (and(at ?truck ?from)
            (truck ?truck)
            (location ?from)
            (location ?to)
            (current_time ?day1)
            (day-to-day ?day1 ?day2)
        )
        :effect (and
            (not (At ?truck ?from))
            (at ?truck ?to)
            (increase (total-cost) 3) 
            (not (current_time ?day1))
            (current_time ?day2)
        )
    )
    ; pick-up cargo from a location and put on the truck 
    ; the action has a cost of 1 unit
    (:action pick-up
        :parameters (?cargo ?truck ?location)
        :precondition (and (at ?cargo ?location)
            (at ?cargo ?location)
            (at ?truck ?location)
            (cargo ?cargo)
            (truck ?truck)
            (Location ?location)

        )
        :effect (and
            (not (at ?cargo ?location))
            (in ?cargo ?truck)
            (increase (total-cost) 1)
        )
    )
    ; drop cargo from the truck to the location
    ; the action has a cost of 1 unit
    (:action drop
        :parameters (?cargo ?truck ?location)
        :precondition (and (in ?cargo ?truck)
            (at ?truck ?location)
            (cargo ?cargo)
            (truck ?truck)
            (location ?location))
        :effect (and
            (not (in ?cargo ?truck))
            (at ?cargo ?location)
            (increase (total-cost) 1)
        )
    )
)

; problem
(define (problem Problem3)
    (:domain expensive-transport)

    (:objects

        cargo1 cargo2 cargo3 cargo4 cargo5 cargo6 truck1 truck2 plane1 plane2 Manchester Birmingham London New-york d1 d2 d3 d4 d5 d6 d7

    )

    (:init
        (= (total-cost) 0)
        (current_time d1)
        (day-to-day d1 d2)
        (day-to-day d2 d3)
        (day-to-day d3 d4)
        (day-to-day d4 d5)
        (day-to-day d5 d6)
        (day-to-day d6 d7)
        (Cargo cargo1)
        (Cargo cargo2)
        (Cargo cargo3)
        (Cargo cargo4)
        (Cargo cargo5)
        (Cargo cargo6)
        (Truck truck1)
        (Truck truck2)
        (Plane plane1)
        (Plane plane2)
        (Location Manchester)
        (Location Birmingham)
        (Location London)
        (Location New-york)

        (At cargo1 London)
        (At cargo6 London)
        (At truck1 London)

        (At cargo2 Birmingham)
        (At truck2 Birmingham)

        (At cargo3 Manchester)
        (At plane1 Manchester)

        (At cargo4 New-york)
        (At cargo5 New-york)
        (At plane2 New-york)
    )
    (:goal
        (and
            (At cargo2 London)
            (At cargo1 Birmingham)
            (At cargo3 London)
            (At cargo4 Manchester)
            (At cargo6 Manchester)
            (At cargo5 London)

        )
    )
    (:metric minimize
        (total-cost)
    )
)

; plan
1. (pick-up cargo6 truck1 london)
   deleted: (at cargo6 london)
   added: (in cargo6 truck1)
   goals met: 0 of 6
2. (pick-up cargo1 truck1 london)
   deleted: (at cargo1 london)
   added: (in cargo1 truck1)
   goals met: 0 of 6
3. (drive truck1 london new-york d1 d2)
   deleted: (at truck1 london) (current_time d1)
   added: (at truck1 new-york) (current_time d2)
   goals met: 0 of 6
4. (pick-up cargo5 truck1 new-york)
   deleted: (at cargo5 new-york)
   added: (in cargo5 truck1)
   goals met: 0 of 6
5. (pick-up cargo4 truck1 new-york)
   deleted: (at cargo4 new-york)
   added: (in cargo4 truck1)
   goals met: 0 of 6
6. (drive truck1 new-york manchester d2 d3)
   deleted: (at truck1 new-york) (current_time d2)
   added: (at truck1 manchester) (current_time d3)
   goals met: 0 of 6
7. (drop cargo6 truck1 manchester)
   deleted: (in cargo6 truck1)
   added: (at cargo6 manchester)
   goals met: 1 of 6
8. (drop cargo4 truck1 manchester)
   deleted: (in cargo4 truck1)
   added: (at cargo4 manchester)
   goals met: 2 of 6
9. (pick-up cargo3 truck1 manchester)
   deleted: (at cargo3 manchester)
   added: (in cargo3 truck1)
   goals met: 2 of 6
10. (drive truck1 manchester birmingham d3 d4)
   deleted: (at truck1 manchester) (current_time d3)
   added: (at truck1 birmingham) (current_time d4)
   goals met: 2 of 6
11. (pick-up cargo2 truck1 birmingham)
   deleted: (at cargo2 birmingham)
   added: (in cargo2 truck1)
   goals met: 2 of 6
12. (drop cargo1 truck1 birmingham)
   deleted: (in cargo1 truck1)
   added: (at cargo1 birmingham)
   goals met: 3 of 6
13. (drive truck1 birmingham london d4 d5)
   deleted: (at truck1 birmingham) (current_time d4)
   added: (at truck1 london) (current_time d5)
   goals met: 3 of 6
14. (drop cargo5 truck1 london)
   deleted: (in cargo5 truck1)
   added: (at cargo5 london)
   goals met: 4 of 6
15. (drop cargo3 truck1 london)
   deleted: (in cargo3 truck1)
   added: (at cargo3 london)
   goals met: 5 of 6
16. (drop cargo2 truck1 london)
   deleted: (in cargo2 truck1)
   added: (at cargo2 london)
   goals met: 6 of 6
